# 生成 irc 彩色纳粹标志 卐 的 shell 命令
# 红色: 05(棕色，深红) 或者 04(红)
# 白色: 00(白) 或者 14(深灰) 15浅灰
# 黑色: 01(黑) 或者 关闭颜色(0x0F)
# 18x9 字符，横向两个字符长度 = 纵向一个字符长度

# 版本1：生成的结果适用于各种不同背景色（如: kvirc 默认是白色背景，weechat、irssi 默认是黑色背景）的 irc 终端
echo -e '\x03,05                  \x0f\n\x03,05  \x03,15              \x03,05  \x0f\n\x03,05  \x03,15  \x03,01  \x03,15  \x03,01      \x03,15  \x03,05  \x0f\n\x03,05  \x03,15  \x03,01  \x03,15  \x03,01  \x03,15      \x03,05  \x0f\n\x03,05  \x03,15  \x03,01          \x03,15  \x03,05  \x0f\n\x03,05  \x03,15      \x03,01  \x03,15  \x03,01  \x03,15  \x03,05  \x0f\n\x03,05  \x03,15  \x03,01      \x03,15  \x03,01  \x03,15  \x03,05  \x0f\n\x03,05  \x03,15              \x03,05  \x0f\n\x03,05                  \x0f'

# 适用于黑色背景的 irc 终端
echo -e '\x03,05                  \x0f\n\x03,05  \x03,15              \x03,05  \x0f\n\x03,05  \x03,15  \x0f  \x03,15  \x0f      \x03,15  \x03,05  \x0f\n\x03,05  \x03,15  \x0f  \x03,15  \x0f  \x03,15      \x03,05  \x0f\n\x03,05  \x03,15  \x0f          \x03,15  \x03,05  \x0f\n\x03,05  \x03,15      \x0f  \x03,15  \x0f  \x03,15  \x03,05  \x0f\n\x03,05  \x03,15  \x0f      \x03,15  \x0f  \x03,15  \x03,05  \x0f\n\x03,05  \x03,15              \x03,05  \x0f\n\x03,05                  \x0f'
# 与上面的命令类似，并把行尾的 \x0f 关闭（----这可能导致在运行 bot 的服务器上的输出会变色----xxx 不会变色，这不是 ANSI Escape）
echo -e '\x03,05                  \n\x03,05  \x03,15              \x03,05  \n\x03,05  \x03,15  \x0f  \x03,15  \x0f      \x03,15  \x03,05  \n\x03,05  \x03,15  \x0f  \x03,15  \x0f  \x03,15      \x03,05  \n\x03,05  \x03,15  \x0f          \x03,15  \x03,05  \n\x03,05  \x03,15      \x0f  \x03,15  \x0f  \x03,15  \x03,05  \n\x03,05  \x03,15  \x0f      \x03,15  \x0f  \x03,15  \x03,05  \n\x03,05  \x03,15              \x03,05  \n\x03,05                  '
# 与上面类似，再把 05 精简为 5
echo -e '\x03,5                  \n\x03,5  \x03,15              \x03,5  \n\x03,5  \x03,15  \x0f  \x03,15  \x0f      \x03,15  \x03,5  \n\x03,5  \x03,15  \x0f  \x03,15  \x0f  \x03,15      \x03,5  \n\x03,5  \x03,15  \x0f          \x03,15  \x03,5  \n\x03,5  \x03,15      \x0f  \x03,15  \x0f  \x03,15  \x03,5  \n\x03,5  \x03,15  \x0f      \x03,15  \x0f  \x03,15  \x03,5  \n\x03,5  \x03,15              \x03,5  \n\x03,5                  '
# 与上面类似，再把 15 精简为 0
echo -e '\x03,5                  \n\x03,5  \x03,0              \x03,5  \n\x03,5  \x03,0  \x0f  \x03,0  \x0f      \x03,0  \x03,5  \n\x03,5  \x03,0  \x0f  \x03,0  \x0f  \x03,0      \x03,5  \n\x03,5  \x03,0  \x0f          \x03,0  \x03,5  \n\x03,5  \x03,0      \x0f  \x03,0  \x0f  \x03,0  \x03,5  \n\x03,5  \x03,0  \x0f      \x03,0  \x0f  \x03,0  \x03,5  \n\x03,5  \x03,0              \x03,5  \n\x03,5                  '

# 减肥版
echo -e '\x03,05         \n\x03,05 \x03,15       \x03,05 \n\x03,05 \x03,15 \x0f \x03,15 \x0f   \x03,15 \x03,05 \n\x03,05 \x03,15 \x0f \x03,15 \x0f \x03,15   \x03,05 \n\x03,05 \x03,15 \x0f     \x03,15 \x03,05 \n\x03,05 \x03,15   \x0f \x03,15 \x0f \x03,15 \x03,05 \n\x03,05 \x03,15 \x0f   \x03,15 \x0f \x03,15 \x03,05 \n\x03,05 \x03,15       \x03,05 \n\x03,05         \x0f'

# 生成 shell 中的彩色纳粹标志 卐 的 shell 命令
# 红色: 41
# 白色: 1;47
# 黑色: 40
echo -e '\x1b[41m                  \x1b[m\n\x1b[41m  \x1b[1;47m              \x1b[41m  \x1b[m\n\x1b[41m  \x1b[1;47m  \x1b[40m  \x1b[1;47m  \x1b[40m      \x1b[1;47m  \x1b[41m  \x1b[m\n\x1b[41m  \x1b[1;47m  \x1b[40m  \x1b[1;47m  \x1b[40m  \x1b[1;47m      \x1b[41m  \x1b[m\n\x1b[41m  \x1b[1;47m  \x1b[40m          \x1b[1;47m  \x1b[41m  \x1b[m\n\x1b[41m  \x1b[1;47m      \x1b[40m  \x1b[1;47m  \x1b[40m  \x1b[1;47m  \x1b[41m  \x1b[m\n\x1b[41m  \x1b[1;47m  \x1b[40m      \x1b[1;47m  \x1b[40m  \x1b[1;47m  \x1b[41m  \x1b[m\n\x1b[41m  \x1b[1;47m              \x1b[41m  \x1b[m\n\x1b[41m                  \x1b[m'


# 生成 irc 彩色佛教的万佛朝宗标志 卍 的 shell 命令
# 黄色: 07(深黄) 08(浅黄)
# 黑色: 01(黑) 或者 关闭颜色(0x0F)
# 10x5字符，横向两个字符长度 = 纵向一个字符长度

# 版本1：生成的结果适用于各种不同背景色（如: kvirc 默认是白色背景，weechat、irssi 默认是黑色背景）的 irc 终端
echo -e '万佛朝宗标志 卍\n\x03,07      \x0f  \x03,07  \x0f\n    \x03,07  \x0f  \x03,07  \x0f\n\x03,07          \x0f\n\x03,07  \x0f  \x03,07  \x0f    \n\x03,07  \x0f  \x03,07      \x0f'

# shell 版本
echo -e '万佛朝宗标志 卍\n\x1b[43m      \x1b[m  \x1b[43m  \x1b[m\n    \x1b[43m  \x1b[m  \x1b[43m  \x1b[m\n\x1b[43m          \x1b[m\n\x1b[43m  \x1b[m  \x1b[43m  \x1b[m    \n\x1b[43m  \x1b[m  \x1b[43m      \x1b[m'
